# Вы пользуетесь общественным транспортом? 
# Вероятно, вы расплачивались за проезд и получали билет с номером. 
# Счастливым билетом называют такой билет с шестизначным номером, 
# где сумма первых трех цифр равна сумме последних трех. 
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. 
# Вам требуется написать программу, которая проверяет счастливость билета.

# *Пример:*

# 385916 -> yes
# 123456 -> no

numb = int (input ('Введите число: '))
firstnumb = numb//1000
secondnumb = numb%1000
firstsum = (firstnumb//100) + (firstnumb%10) + ((firstnumb//10)%10)
secondsum = (secondnumb//100) + (secondnumb%10) + ((secondnumb//10)%10)
if firstsum == secondsum:      
    print ("yes")
else:
    print ("no")