# Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |


numb = int (input ('Введите число: '))
sum = ((numb//100) + (numb%10) + ((numb//10)%10))
print (sum)